app/views/evaluation/missing_data.html.haml

SELECT  "instructors".* FROM "instructors"  WHERE "instructors"."id" = ? LIMIT 1  [["id", 1]]
---
          %td
            - if evaluation.instructor.present?