app/views/instructor/show.html.haml

            = course_section_group.first.course_name
            (
            = link_to((course_section_group.first.has_course_name? ? "Edit" : "Add Course Name"), new_course_name_path(subject_course: course_section_group.first.subject_course, return_to: instructor_path(@instructor)))
            )
---
SELECT  "course_names".* FROM "course_names"  WHERE "course_names"."subject_course" = 'CSCE 121'  ORDER BY "course_names"."id" ASC LIMIT 1