app/controllers/evaluation_controller.rb

  def index
    if can? :read, :all

      selected_instructor = params[:instructor];
      selected_course = params[:course_name];
      selected_year = params[:year];
      selected_semester = params[:semester];

      if selected_year.nil? || selected_semester.nil?
        yr_smstr = Evaluation.no_missing_data.pluck(:term).uniq.sort.reverse.first
---
SELECT "evaluations"."term" FROM "evaluations"  WHERE (NOT (instructor_id is NULL OR enrollment is NULL OR item1_mean is NULL OR item2_mean is NULL OR item3_mean is NULL OR item4_mean is NULL OR item5_mean is NULL OR item6_mean is NULL OR item7_mean is NULL OR item8_mean is NULL))

  def show
    if can? :read, :all
      @terms = Evaluation.pluck(:term).uniq.sort.reverse
      @instructor_names = Instructor.pluck(:name).uniq.sort
      @course_names = CourseName.pluck(:subject_course, :name).uniq.sort
      merge_subj_name = lambda { |subj, name| return name.nil? ? subj : subj + " " + name }

      @course_names.map! { |crs|
        merge_subj_name.call(crs[0], crs[1])
      }

      @semesters = ["A", "B", "C"]
      @years = []
      @terms.each do |e|
---
SELECT "evaluations"."term" FROM "evaluations"
SELECT "evaluations".* FROM "evaluations"  WHERE (NOT (instructor_id is NULL OR enrollment is NULL OR item1_mean is NULL OR item2_mean is NULL OR item3_mean is NULL OR item4_mean is NULL OR item5_mean is NULL OR item6_mean is NULL OR item7_mean is NULL OR item8_mean is NULL)) AND "evaluations"."term" = '2015C'

  def export
      #term = params.require(:id)
      @terms = Evaluation.pluck(:term).uniq.sort.reverse
      @instructor_names = Instructor.pluck(:name).uniq.sort
      @course_names = CourseName.pluck(:subject_course, :name).uniq.sort
      merge_subj_name = lambda { |subj, name| return name.nil? ? subj : subj + " " + name }

      @course_names.map! { |crs|
        merge_subj_name.call(crs[0], crs[1])
      }

      @semesters = ["A", "B", "C"]
      @years = []
      @terms.each do |e|
---
SELECT "evaluations".* FROM "evaluations"  WHERE (NOT (instructor_id is NULL OR enrollment is NULL OR item1_mean is NULL OR item2_mean is NULL OR item3_mean is NULL OR item4_mean is NULL OR item5_mean is NULL OR item6_mean is NULL OR item7_mean is NULL OR item8_mean is NULL)) AND "evaluations"."term" = '2015C'

  def edit
    @evaluation = Evaluation.find(evaluation_id)
---
SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @evaluation = Evaluation.find(evaluation_id)
    key_string = @evaluation.key.values.map(&:to_s).join("-")
    @evaluation.destroy
---
SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "evaluations" WHERE "evaluations"."id" = ?  [["id", 1]]